//Dmitrieva_Olesya_Andreevna_SBD211

#include <iostream>     //ввод-вывод данных
using namespace std;    //чтобы не писать каждый раз std

/*
----------------------------------------------
\b  удаление последнего выведенного символа
\n  перейти на начало новой строки
\t  перейти к следующей позиции табуляции

\\  вывести обратную черту \
\"  вывести двойную кавычку "
\'  вывести одинарную кавычку '
----------------------------------------------
*/

int main()
{
	setlocale(0, "");     //отображение кириллицы на экране
        cout << "\t\t\t\t\t В лесу родилась елочка,     \n";
	cout << "\t\t\t\t\t В лесу она росла,           \n";
	cout << "\t\t\t\t\t Зимой и летом стройная,     \n";
	cout << "\t\t\t\t\t Зеленая была.               \n\n";

	cout << "\t\t\t\t\t Метель ей пела песенку :    \n";
	cout << "\t\t\t\t\t «Спи, елочка, бай - бай!»   \n";
	cout << "\t\t\t\t\t Мороз снежком укутывал :    \n";
	cout << "\t\t\t\t\t «Смотри, не замерзай!»      \n\n";

	cout << "\t\t\t\t\t Трусишка зайка серенький    \n";
	cout << "\t\t\t\t\t Под елочкой скакал.         \n";
	cout << "\t\t\t\t\t Порою волк, сердитый волк   \n";
	cout << "\t\t\t\t\t Рысцою пробегал.            \n\n";

	cout << "\t\t\t\t\t Чу!Снег по лесу частому     \n";
	cout << "\t\t\t\t\t Под полозом скрипит,        \n";
	cout << "\t\t\t\t\t Лошадка мохноногая          \n";
	cout << "\t\t\t\t\t Торопится, бежит.           \n\n";

	cout << "\t\t\t\t\t Везет лошадка дровенки,     \n";
	cout << "\t\t\t\t\t А в дровнях старичок,       \n";
	cout << "\t\t\t\t\t Срубил он нашу елочку       \n";
	cout << "\t\t\t\t\t Под самый корешок.          \n\n";

	cout << "\t\t\t\t\t Теперь она, нарядная,       \n";
	cout << "\t\t\t\t\t Hа праздник к нам пришла    \n";
	cout << "\t\t\t\t\t И много, много радости      \n";
        cout << "\t\t\t\t\t Детишкам принесла!          \n\n";
	return 0;
}
